Revit 2027 API
PolyLine.Create Method
Creates a polyline with coordinate points provided.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static PolyLine Create(
	IList<XYZ> coordinates
)
Public Shared Function Create (
	coordinates As IList(Of XYZ)
) As PolyLine
public:
static PolyLine^ Create(
	IList<XYZ^>^ coordinates
)
static member Create :
        coordinates : IList<XYZ> -> PolyLine
Parameters
coordinates IList<XYZ>
Return Value
PolyLine
Exceptions
Exception | Condition
ArgumentException |  Thrown when the count of coordinates is less than 2.
See Also
Reference
PolyLine Class
Autodesk.Revit.DB Namespace